#include <iostream>
using namespace std;
int main()
{
    setlocale(0, "");

    int sum = 0, input;

    cout << "1. Как называется еврейский Новый год?\n" << 
        "    1 - Ханука    2 - Кванза    3 - Рош ха-Шана" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "2. Сколько синих полос на флаге США?\n" <<
        "    1 - 0    2 - 51    3 - 3" << endl;
    cin >> input;
    input == 1 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "3. Кто из этих персонажей не дружит с Гарри Поттером?\n" <<
        "    1 - Рон Уизли    2 - Драко Малфой    3 - Невилл Лонгботтом" << endl;
    cin >> input;
    input == 2 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "4. Какое животное не фигурирует в китайском зодиаке?\n" <<
        "    1 - Дракон    2 - Кролик    3 - Колибри" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "5. В какой стране проходили летние Олимпийские игры 2016 года?\n" <<
        "    1 - Китай    2 - Италия    3 - Бразилия" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "6. Какая планета самая горячая?\n" <<
        "    1 - Венера    2 - Марс    3 - Меркурий" << endl;
    cin >> input;
    input == 1 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "7. Как назывался корабль капитана Джека Воробья в \"Пиратах Карибского моря\"?\n" <<
        "    1 - Мародер    2 - Слизерин    3 - Черная жемчужина" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "8. Какая самая редкая группа крови?\n" <<
        "    1 -  II группа    2 -  I группа    3 - IV группа" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "9. Кто из этих персонажей не входит в группу друзей из сериала \"Друзья\"?\n" <<
        "    1 - Джоуи    2 - Гюнтер    3 - Моника" << endl;
    cin >> input;
    input == 2 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "10. Сколько костей в теле человека?\n" <<
        "    1 - 209    2 - 206    3 - 201" << endl;
    cin >> input;
    input == 2 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "11.  Fe — это символ какого химического элемента??\n" <<
        "    1 - Фтор    2 - Водород    3 - Железо" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "12. На каком языке говорит больше всего людей на Земле?\n" <<
        "    1 - китайский    2 - английский    3 - арабский" << endl;
    cin >> input;
    input == 1 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "13. Какая самая короткая трагедия Шекспира?\n" <<
        "    1 - Макбет    2 - Гамлет    3 - Ромео и Джульетта" << endl;
    cin >> input;
    input == 1 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "14. Сколько сердец у осьминога?\n" <<
        "    1 - 5    2 - 4    3 - 3" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "15. Какая социальная сеть появилась в 2003 году?\n" <<
        "    1 - Twitter    2 - Facebook    3 - Myspace" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "16. Какая планета в нашей Солнечной системе самая большая?\n" <<
        "    1 - Юпитер    2 - Нептун    3 - Сатурн" << endl;
    cin >> input;
    input == 1 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "17. Кто расписывал потолок Сикстинской капеллы?\n" <<
        "    1 - Леонардо Да Винчи    2 - Микеланджело    3 - Винсент Ван Гог" << endl;
    cin >> input;
    input == 2 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "18. Какой океан самый большой на Земле?\n" <<
        "    1 - Атлантический    2 - Тихий    3 - Индийский" << endl;
    cin >> input;
    input == 2 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "19.  Кто нарисовал Мону Лизу?\n" <<
        "    1 - Винсент Ван Гог    2 - Леонардо да Винчи    3 - Клод Моне" << endl;
    cin >> input;
    input == 2 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "20. Какая страна потребляет больше всего шоколада?\n" <<
        "    1 - Испания    2 - Германия    3 - Швейцария" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
}